<?php

// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
//定义回调URL通用的URL
define('URL_CALLBACK', '/home/?m=Index&a=callback&type=');

return [
// +----------------------------------------------------------------------
// | 站点设置
// +----------------------------------------------------------------------
    'title' => '美丽乡村',
    'keywords' => '美丽乡村,乡土特产,乡村建设,乡村旅游,旅游景点,望得见山,看得见水,记得住乡愁,乡村资讯,政策资金,地方节庆,理论研究,乡村文化遗产,乡村视频,乡村游最佳目的地',
    'description' => '发现乡村之美、宣传美丽乡村、推介乡土特产、订制乡村旅游、规划乡村建设、品鉴乡村美食、传承乡土文化、扶植乡村产业、打造品牌乡村旅游景点，为美丽中国的美丽乡村建设添砖加瓦。',
    //腾讯QQ登录配置
    'TICKY_SDK_QQ' => array(
        'APP_KEY' => '', //应用注册成功后分配的 APP ID
        'APP_SECRET' => '', //应用注册成功后分配的KEY
        'CALLBACK' => URL_CALLBACK . 'qq',
    ),
    //新浪微博配置
    'TICKY_SDK_SINA' => array(
        'APP_KEY' => '', //应用注册成功后分配的 APP ID
        'APP_SECRET' => '', //应用注册成功后分配的KEY
        'CALLBACK' => URL_CALLBACK . 'sina',
    ),
    //淘宝网配置
    'TICKY_SDK_TAOBAO' => array(
        'APP_KEY' => '', //应用注册成功后分配的 APP ID
        'APP_SECRET' => '', //应用注册成功后分配的KEY
        'CALLBACK' => URL_CALLBACK . 'taobao',
    ),
];
